app/controllers/account/tips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tips".* FROM "tips" WHERE "tips"."user_id" = ? ORDER BY "tips"."updated_at" DESC  [["user_id", 5]]
---
    def index
      user = User.find(session[:user_id])
      @tips = user.tips.order(updated_at: :desc)