app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.tip = @tip


    @comment.user = current_user

    respond_to do |format|

      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "tip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "It's cool."], ["user_id", 3], ["tip_id", 16], ["created_at", "2021-11-02 08:35:13.459366"], ["updated_at", "2021-11-02 08:35:13.459366"]]

    def set_tip
      @tip = Tip.find(params[:tip_id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]