app/controllers/tips_controller.rb

  def index
    @search_term = params[:q]
    logger.info("Search completed using #{@search_term}.")
    @tips = Tip.search(@search_term).page(params[:page])
---
SELECT  "tips".* FROM "tips" WHERE ((title LIKE '%%') OR (body LIKE '%%')) LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tips" WHERE ((title LIKE '%%') OR (body LIKE '%%'))

  def create
    @tip = Tip.new(tip_params)

    user = User.find(session[:user_id])
    @tip.user = user

    respond_to do |format|
      if @tip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tips" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ArcGIS and Ruby Gems"], ["body", "Ruby Gems for online mapping with ArcGIS"], ["user_id", 5], ["created_at", "2021-10-28 08:27:17.736040"], ["updated_at", "2021-10-28 08:27:17.736040"]]

  def update

    user = User.find(session[:user_id])
    @tip.user = user

    respond_to do |format|
      if @tip.update(tip_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tips" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "tips"."id" = ?  [["title", "ArcGIS and Ruby Gems"], ["body", "Ruby Gems for ArcGIS is great for online mapping using ESRI technology."], ["updated_at", "2021-11-02 08:34:05.737107"], ["id", 16]]

  def destroy
    @tip.destroy!
---
DELETE FROM "tips" WHERE "tips"."id" = ?  [["id", 13]]

  def set_tip
    @tip = Tip.find(params[:id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]