app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.page(params[:page])

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "new@epfl.ch"], ["name", "User One"], ["created_at", "2021-10-27 19:12:04.320034"], ["updated_at", "2021-10-27 19:12:04.320034"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "avatar" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "New"], ["avatar", "flagcow.jpg"], ["password_digest", "$2a$12$2cVoBbiDKoMhTOMWaXgGFuyit9DZuu6bVNDeumd9Q4He9EM1BApW."], ["updated_at", "2021-10-28 08:26:35.757508"], ["id", 5]]
---
  def update

    respond_to do |format|
      if @user.update(edit_user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "tips_users" WHERE "tips_users"."user_id" = ?  [["user_id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy