app/views/application/_user_card.html.erb

        <%= link_to translate('edit'), edit_user_path(user), class: 'btn btn-outline-secondary mr-3' %>
        <% if user.tips.count == 0 && user.comments.count == 0 %>
---
SELECT  "tips".* FROM "tips" WHERE "tips"."user_id" = ? ORDER BY "tips"."id" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" INNER JOIN "tips" ON "comments"."tip_id" = "tips"."id" WHERE "tips"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "tips" WHERE "tips"."user_id" = ?  [["user_id", 1]]

  <div class="card-body">
    <% if user.tips.any? %>
---
SELECT  1 AS one FROM "tips" WHERE "tips"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]