app/views/tips/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."tip_id" = ? ORDER BY "comments"."created_at" ASC  [["tip_id", 13]]
---
    <div class="m-3">
      <% @tip.comments.order(created_at: :asc).each do |comment| %>